SozonovAA/dissertation/TMS_450_MATLAB/TMS320F28335.c
    }

}

#endif

#define MDL_START  /* Change to #undef to remove function */
#if defined(MDL_START)
/* Function: mdlStart =======================================================
 * Abstract:
 *    This function is called once at start of model execution. If you
 *    have states that should be initialized once, this is the place
 *    to do it.
 */
static void mdlStart(SimStruct *S)
{
    /* Bus Information */
    slDataTypeAccess *dta = ssGetDataTypeAccess(S);
    const char *bpath = ssGetPath(S);
	DTypeId DebugInfLId = ssGetDataTypeId(S, "DebugInfL");
	DTypeId DebugInfRId = ssGetDataTypeId(S, "DebugInfR");

	busInfoStruct *busInfo = (busInfoStruct *)malloc(356*sizeof(busInfoStruct));
	if(busInfo==NULL) {
        ssSetErrorStatus(S, "Memory allocation failure");
        return;
    }

      /* Calculate offsets of all primitive elements of the bus */

	busInfo[0].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 0);
	busInfo[0].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[0].numElems = 1;
	busInfo[1].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 1);
	busInfo[1].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[1].numElems = 1;
	busInfo[2].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 2);
	busInfo[2].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[2].numElems = 1;
	busInfo[3].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 3);
	busInfo[3].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[3].numElems = 1;
	busInfo[4].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 4);
	busInfo[4].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[4].numElems = 1;
	busInfo[5].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 5);
	busInfo[5].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[5].numElems = 1;
	busInfo[6].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 6);
	busInfo[6].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[6].numElems = 1;
	busInfo[7].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 7);
	busInfo[7].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[7].numElems = 1;
	busInfo[8].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 8);
	busInfo[8].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[8].numElems = 1;
	busInfo[9].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 9);
	busInfo[9].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[9].numElems = 1;
	busInfo[10].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 10);
	busInfo[10].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[10].numElems = 1;
	busInfo[11].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 11);
	busInfo[11].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[11].numElems = 1;
	busInfo[12].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 12);
	busInfo[12].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[12].numElems = 1;
	busInfo[13].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 13);
	busInfo[13].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[13].numElems = 1;
	busInfo[14].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 14);
	busInfo[14].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[14].numElems = 1;
	busInfo[15].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 15);
	busInfo[15].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[15].numElems = 1;
	busInfo[16].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 16);
	busInfo[16].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[16].numElems = 1;
	busInfo[17].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 17);
	busInfo[17].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[17].numElems = 1;
	busInfo[18].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 18);
	busInfo[18].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[18].numElems = 1;
	busInfo[19].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 19);
	busInfo[19].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[19].numElems = 1;
	busInfo[20].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 20);
	busInfo[20].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[20].numElems = 1;
	busInfo[21].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 21);
	busInfo[21].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[21].numElems = 1;
	busInfo[22].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 22);
	busInfo[22].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[22].numElems = 1;
	busInfo[23].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 23);
	busInfo[23].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[23].numElems = 1;
	busInfo[24].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 24);
	busInfo[24].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[24].numElems = 1;
	busInfo[25].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 25);
	busInfo[25].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[25].numElems = 1;
	busInfo[26].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 26);
	busInfo[26].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[26].numElems = 1;
	busInfo[27].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 27);
	busInfo[27].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[27].numElems = 1;
	busInfo[28].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 28);
	busInfo[28].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[28].numElems = 1;
	busInfo[29].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 29);
	busInfo[29].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[29].numElems = 1;
	busInfo[30].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 30);
	busInfo[30].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[30].numElems = 1;
	busInfo[31].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 31);
	busInfo[31].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[31].numElems = 1;
	busInfo[32].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 32);
	busInfo[32].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[32].numElems = 1;
	busInfo[33].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 33);
	busInfo[33].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[33].numElems = 1;
	busInfo[34].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 34);
	busInfo[34].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[34].numElems = 1;
	busInfo[35].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 35);
	busInfo[35].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[35].numElems = 1;
	busInfo[36].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 36);
	busInfo[36].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[36].numElems = 1;
	busInfo[37].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 37);
	busInfo[37].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[37].numElems = 1;
	busInfo[38].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 38);
	busInfo[38].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[38].numElems = 1;
	busInfo[39].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 39);
	busInfo[39].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[39].numElems = 1;
	busInfo[40].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 40);
	busInfo[40].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[40].numElems = 1;
	busInfo[41].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 41);
	busInfo[41].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[41].numElems = 1;
	busInfo[42].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 42);
	busInfo[42].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[42].numElems = 1;
	busInfo[43].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 43);
	busInfo[43].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[43].numElems = 1;
	busInfo[44].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 44);
	busInfo[44].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[44].numElems = 1;
	busInfo[45].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 45);
	busInfo[45].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[45].numElems = 1;
	busInfo[46].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 46);
	busInfo[46].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[46].numElems = 1;
	busInfo[47].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 47);
	busInfo[47].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[47].numElems = 1;
	busInfo[48].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 48);
	busInfo[48].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[48].numElems = 1;
	busInfo[49].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 49);
	busInfo[49].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[49].numElems = 1;
	busInfo[50].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 50);
	busInfo[50].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[50].numElems = 1;
	busInfo[51].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 51);
	busInfo[51].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[51].numElems = 1;
	busInfo[52].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 52);
	busInfo[52].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[52].numElems = 1;
	busInfo[53].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 53);
	busInfo[53].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[53].numElems = 1;
	busInfo[54].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 54);
	busInfo[54].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[54].numElems = 1;
	busInfo[55].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 55);
	busInfo[55].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[55].numElems = 1;
	busInfo[56].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 56);
	busInfo[56].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[56].numElems = 1;
	busInfo[57].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 57);
	busInfo[57].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[57].numElems = 1;
	busInfo[58].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 58);
	busInfo[58].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[58].numElems = 1;
	busInfo[59].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 59);
	busInfo[59].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[59].numElems = 1;
	busInfo[60].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 60);
	busInfo[60].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[60].numElems = 1;
	busInfo[61].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 61);
	busInfo[61].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[61].numElems = 1;
	busInfo[62].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 62);
	busInfo[62].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[62].numElems = 1;
	busInfo[63].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 63);
	busInfo[63].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[63].numElems = 1;
	busInfo[64].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 64);
	busInfo[64].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[64].numElems = 1;
	busInfo[65].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 65);
	busInfo[65].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[65].numElems = 1;
	busInfo[66].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 66);
	busInfo[66].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[66].numElems = 1;
	busInfo[67].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 67);
	busInfo[67].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[67].numElems = 1;
	busInfo[68].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 68);
	busInfo[68].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[68].numElems = 1;
	busInfo[69].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 69);
	busInfo[69].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[69].numElems = 1;
	busInfo[70].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 70);
	busInfo[70].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[70].numElems = 1;
	busInfo[71].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 71);
	busInfo[71].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[71].numElems = 1;
	busInfo[72].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 72);
	busInfo[72].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[72].numElems = 1;
	busInfo[73].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 73);
	busInfo[73].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[73].numElems = 1;
	busInfo[74].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 74);
	busInfo[74].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[74].numElems = 1;
	busInfo[75].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 75);
	busInfo[75].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[75].numElems = 1;
	busInfo[76].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 76);
	busInfo[76].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[76].numElems = 1;
	busInfo[77].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 77);
	busInfo[77].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[77].numElems = 1;
	busInfo[78].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 78);
	busInfo[78].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[78].numElems = 1;
	busInfo[79].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 79);
	busInfo[79].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[79].numElems = 1;
	busInfo[80].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 80);
	busInfo[80].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[80].numElems = 1;
	busInfo[81].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 81);
	busInfo[81].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[81].numElems = 1;
	busInfo[82].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 82);
	busInfo[82].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[82].numElems = 1;
	busInfo[83].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 83);
	busInfo[83].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[83].numElems = 1;
	busInfo[84].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 84);
	busInfo[84].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[84].numElems = 1;
	busInfo[85].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 85);
	busInfo[85].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[85].numElems = 1;
	busInfo[86].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 86);
	busInfo[86].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[86].numElems = 1;
	busInfo[87].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 87);
	busInfo[87].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[87].numElems = 1;
	busInfo[88].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 88);
	busInfo[88].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[88].numElems = 1;
	busInfo[89].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 89);
	busInfo[89].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[89].numElems = 1;
	busInfo[90].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 90);
	busInfo[90].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[90].numElems = 1;
	busInfo[91].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 91);
	busInfo[91].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[91].numElems = 1;
	busInfo[92].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 92);
	busInfo[92].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[92].numElems = 1;
	busInfo[93].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 93);
	busInfo[93].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[93].numElems = 1;
	busInfo[94].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 94);
	busInfo[94].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[94].numElems = 1;
	busInfo[95].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 95);
	busInfo[95].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[95].numElems = 1;
	busInfo[96].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 96);
	busInfo[96].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[96].numElems = 1;
	busInfo[97].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 97);
	busInfo[97].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[97].numElems = 1;
	busInfo[98].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 98);
	busInfo[98].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[98].numElems = 1;
	busInfo[99].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 99);
	busInfo[99].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[99].numElems = 1;
	busInfo[100].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 100);
	busInfo[100].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[100].numElems = 1;
	busInfo[101].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 101);
	busInfo[101].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[101].numElems = 1;
	busInfo[102].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfLId, 102);
	busInfo[102].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[102].numElems = 1;
	busInfo[103].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 0);
	busInfo[103].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[103].numElems = 1;
	busInfo[104].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 1);
	busInfo[104].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[104].numElems = 1;
	busInfo[105].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 2);
	busInfo[105].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[105].numElems = 1;
	busInfo[106].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 3);
	busInfo[106].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[106].numElems = 1;
	busInfo[107].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 4);
	busInfo[107].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[107].numElems = 1;
	busInfo[108].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 5);
	busInfo[108].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[108].numElems = 1;
	busInfo[109].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 6);
	busInfo[109].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[109].numElems = 1;
	busInfo[110].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 7);
	busInfo[110].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[110].numElems = 1;
	busInfo[111].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 8);
	busInfo[111].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[111].numElems = 1;
	busInfo[112].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 9);
	busInfo[112].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[112].numElems = 1;
	busInfo[113].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 10);
	busInfo[113].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[113].numElems = 1;
	busInfo[114].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 11);
	busInfo[114].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[114].numElems = 1;
	busInfo[115].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 12);
	busInfo[115].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[115].numElems = 1;
	busInfo[116].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 13);
	busInfo[116].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[116].numElems = 1;
	busInfo[117].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 14);
	busInfo[117].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[117].numElems = 1;
	busInfo[118].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 15);
