SozonovAA/dissertation/TMS_450_MATLAB/TMS320F28335.c
	busInfo[118].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[118].numElems = 1;
	busInfo[119].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 16);
	busInfo[119].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[119].numElems = 1;
	busInfo[120].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 17);
	busInfo[120].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[120].numElems = 1;
	busInfo[121].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 18);
	busInfo[121].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[121].numElems = 1;
	busInfo[122].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 19);
	busInfo[122].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[122].numElems = 1;
	busInfo[123].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 20);
	busInfo[123].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[123].numElems = 1;
	busInfo[124].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 21);
	busInfo[124].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[124].numElems = 1;
	busInfo[125].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 22);
	busInfo[125].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[125].numElems = 1;
	busInfo[126].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 23);
	busInfo[126].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[126].numElems = 1;
	busInfo[127].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 24);
	busInfo[127].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[127].numElems = 1;
	busInfo[128].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 25);
	busInfo[128].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[128].numElems = 1;
	busInfo[129].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 26);
	busInfo[129].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[129].numElems = 1;
	busInfo[130].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 27);
	busInfo[130].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[130].numElems = 1;
	busInfo[131].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 28);
	busInfo[131].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[131].numElems = 1;
	busInfo[132].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 29);
	busInfo[132].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[132].numElems = 1;
	busInfo[133].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 30);
	busInfo[133].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[133].numElems = 1;
	busInfo[134].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 31);
	busInfo[134].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[134].numElems = 1;
	busInfo[135].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 32);
	busInfo[135].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[135].numElems = 1;
	busInfo[136].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 33);
	busInfo[136].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[136].numElems = 1;
	busInfo[137].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 34);
	busInfo[137].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[137].numElems = 1;
	busInfo[138].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 35);
	busInfo[138].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[138].numElems = 1;
	busInfo[139].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 36);
	busInfo[139].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[139].numElems = 1;
	busInfo[140].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 37);
	busInfo[140].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[140].numElems = 1;
	busInfo[141].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 38);
	busInfo[141].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[141].numElems = 1;
	busInfo[142].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 39);
	busInfo[142].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[142].numElems = 1;
	busInfo[143].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 40);
	busInfo[143].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[143].numElems = 1;
	busInfo[144].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 41);
	busInfo[144].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[144].numElems = 1;
	busInfo[145].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 42);
	busInfo[145].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[145].numElems = 1;
	busInfo[146].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 43);
	busInfo[146].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[146].numElems = 1;
	busInfo[147].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 44);
	busInfo[147].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[147].numElems = 1;
	busInfo[148].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 45);
	busInfo[148].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[148].numElems = 1;
	busInfo[149].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 46);
	busInfo[149].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[149].numElems = 1;
	busInfo[150].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 47);
	busInfo[150].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[150].numElems = 1;
	busInfo[151].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 48);
	busInfo[151].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[151].numElems = 1;
	busInfo[152].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 49);
	busInfo[152].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[152].numElems = 1;
	busInfo[153].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 50);
	busInfo[153].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[153].numElems = 1;
	busInfo[154].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 51);
	busInfo[154].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[154].numElems = 1;
	busInfo[155].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 52);
	busInfo[155].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[155].numElems = 1;
	busInfo[156].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 53);
	busInfo[156].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[156].numElems = 1;
	busInfo[157].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 54);
	busInfo[157].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[157].numElems = 1;
	busInfo[158].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 55);
	busInfo[158].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[158].numElems = 1;
	busInfo[159].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 56);
	busInfo[159].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[159].numElems = 1;
	busInfo[160].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 57);
	busInfo[160].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[160].numElems = 1;
	busInfo[161].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 58);
	busInfo[161].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[161].numElems = 1;
	busInfo[162].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 59);
	busInfo[162].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[162].numElems = 1;
	busInfo[163].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 60);
	busInfo[163].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[163].numElems = 1;
	busInfo[164].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 61);
	busInfo[164].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[164].numElems = 1;
	busInfo[165].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 62);
	busInfo[165].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[165].numElems = 1;
	busInfo[166].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 63);
	busInfo[166].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[166].numElems = 1;
	busInfo[167].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 64);
	busInfo[167].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[167].numElems = 1;
	busInfo[168].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 65);
	busInfo[168].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[168].numElems = 1;
	busInfo[169].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 66);
	busInfo[169].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[169].numElems = 1;
	busInfo[170].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 67);
	busInfo[170].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[170].numElems = 1;
	busInfo[171].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 68);
	busInfo[171].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[171].numElems = 1;
	busInfo[172].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 69);
	busInfo[172].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[172].numElems = 1;
	busInfo[173].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 70);
	busInfo[173].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[173].numElems = 1;
	busInfo[174].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 71);
	busInfo[174].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[174].numElems = 1;
	busInfo[175].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 72);
	busInfo[175].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[175].numElems = 1;
	busInfo[176].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 73);
	busInfo[176].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[176].numElems = 1;
	busInfo[177].offset   = dtaGetDataTypeElementOffset(dta, bpath, DebugInfRId, 74);
	busInfo[177].elemSize = dtaGetDataTypeSize(dta, bpath, ssGetDataTypeId(S, "double"));
	busInfo[177].numElems = 1;
	ssSetUserData(S, busInfo);
}
#endif /*  MDL_START */

/* Function: mdlOutputs =======================================================
 *
 */
static void mdlOutputs(SimStruct *S, int_T tid)
{
    const real_T *Lpars = (real_T *) ssGetInputPortRealSignal(S, 0);
    const real_T *Rpars = (real_T *) ssGetInputPortRealSignal(S, 1);
    const real_T *FromKabine = (real_T *) ssGetInputPortRealSignal(S, 2);
    real_T *PWM = (real_T *) ssGetOutputPortRealSignal(S, 0);
    char *Out_L = (char *) ssGetOutputPortSignal(S, 1);
    char *Out_R = (char *) ssGetOutputPortSignal(S, 2);
    real_T *SVPWM = (real_T *) ssGetOutputPortRealSignal(S, 3);

	busInfoStruct* busInfo = (busInfoStruct *) ssGetUserData(S);

	/* Temporary bus copy declarations */
	DebugInfL _Out_LBUS;
	DebugInfR _Out_RBUS;

