SozonovAA/dissertation/TMS_450_MATLAB/TMS320F28335.c
	/* Copy input bus into temporary structure */

    TMS320F28335_Outputs_wrapper(Lpars, Rpars, FromKabine, PWM, &_Out_LBUS, &_Out_RBUS, SVPWM);

	/* Copy temporary structure into output bus */
	(void) memcpy(Out_L + busInfo[0].offset, &_Out_LBUS.D, busInfo[0].elemSize * busInfo[0].numElems);
	(void) memcpy(Out_L + busInfo[1].offset, &_Out_LBUS.Q, busInfo[1].elemSize * busInfo[1].numElems);
	(void) memcpy(Out_L + busInfo[2].offset, &_Out_LBUS.X, busInfo[2].elemSize * busInfo[2].numElems);
	(void) memcpy(Out_L + busInfo[3].offset, &_Out_LBUS.Y, busInfo[3].elemSize * busInfo[3].numElems);
	(void) memcpy(Out_L + busInfo[4].offset, &_Out_LBUS.ampl_svpwm, busInfo[4].elemSize * busInfo[4].numElems);
	(void) memcpy(Out_L + busInfo[5].offset, &_Out_LBUS.DeltaSpeedLCruize, busInfo[5].elemSize * busInfo[5].numElems);
	(void) memcpy(Out_L + busInfo[6].offset, &_Out_LBUS.SpeedLzCruize, busInfo[6].elemSize * busInfo[6].numElems);
	(void) memcpy(Out_L + busInfo[7].offset, &_Out_LBUS.AverageCarSpeed, busInfo[7].elemSize * busInfo[7].numElems);
	(void) memcpy(Out_L + busInfo[8].offset, &_Out_LBUS.CruizeDriveL, busInfo[8].elemSize * busInfo[8].numElems);
	(void) memcpy(Out_L + busInfo[9].offset, &_Out_LBUS.DeltaSpeedLABS, busInfo[9].elemSize * busInfo[9].numElems);
	(void) memcpy(Out_L + busInfo[10].offset, &_Out_LBUS.DeltaAxleSpeedL, busInfo[10].elemSize * busInfo[10].numElems);
	(void) memcpy(Out_L + busInfo[11].offset, &_Out_LBUS.DeltaAxleSpeedR, busInfo[11].elemSize * busInfo[11].numElems);
	(void) memcpy(Out_L + busInfo[12].offset, &_Out_LBUS.AverageAxleSpeed, busInfo[12].elemSize * busInfo[12].numElems);
	(void) memcpy(Out_L + busInfo[13].offset, &_Out_LBUS.deltaAxleProcent, busInfo[13].elemSize * busInfo[13].numElems);
	(void) memcpy(Out_L + busInfo[14].offset, &_Out_LBUS.deltaAxleProcentMAX, busInfo[14].elemSize * busInfo[14].numElems);
	(void) memcpy(Out_L + busInfo[15].offset, &_Out_LBUS.SummSpeedL, busInfo[15].elemSize * busInfo[15].numElems);
	(void) memcpy(Out_L + busInfo[16].offset, &_Out_LBUS.LimitSummSpeedL, busInfo[16].elemSize * busInfo[16].numElems);
	(void) memcpy(Out_L + busInfo[17].offset, &_Out_LBUS.UUqLMAX, busInfo[17].elemSize * busInfo[17].numElems);
	(void) memcpy(Out_L + busInfo[18].offset, &_Out_LBUS.kIqL, busInfo[18].elemSize * busInfo[18].numElems);
	(void) memcpy(Out_L + busInfo[19].offset, &_Out_LBUS.URsAlpha_L, busInfo[19].elemSize * busInfo[19].numElems);
	(void) memcpy(Out_L + busInfo[20].offset, &_Out_LBUS.URsBeta_L, busInfo[20].elemSize * busInfo[20].numElems);
	(void) memcpy(Out_L + busInfo[21].offset, &_Out_LBUS.ULsAlpha_L, busInfo[21].elemSize * busInfo[21].numElems);
	(void) memcpy(Out_L + busInfo[22].offset, &_Out_LBUS.ULsBeta_L, busInfo[22].elemSize * busInfo[22].numElems);
	(void) memcpy(Out_L + busInfo[23].offset, &_Out_LBUS.SpeedLz, busInfo[23].elemSize * busInfo[23].numElems);
	(void) memcpy(Out_L + busInfo[24].offset, &_Out_LBUS.SpeedL, busInfo[24].elemSize * busInfo[24].numElems);
	(void) memcpy(Out_L + busInfo[25].offset, &_Out_LBUS.Udz, busInfo[25].elemSize * busInfo[25].numElems);
	(void) memcpy(Out_L + busInfo[26].offset, &_Out_LBUS.Drive, busInfo[26].elemSize * busInfo[26].numElems);
	(void) memcpy(Out_L + busInfo[27].offset, &_Out_LBUS.Brake, busInfo[27].elemSize * busInfo[27].numElems);
	(void) memcpy(Out_L + busInfo[28].offset, &_Out_LBUS.Debug, busInfo[28].elemSize * busInfo[28].numElems);
	(void) memcpy(Out_L + busInfo[29].offset, &_Out_LBUS.ThetaL, busInfo[29].elemSize * busInfo[29].numElems);
	(void) memcpy(Out_L + busInfo[30].offset, &_Out_LBUS.PowerMax, busInfo[30].elemSize * busInfo[30].numElems);
	(void) memcpy(Out_L + busInfo[31].offset, &_Out_LBUS.Ud, busInfo[31].elemSize * busInfo[31].numElems);
	(void) memcpy(Out_L + busInfo[32].offset, &_Out_LBUS.IaL, busInfo[32].elemSize * busInfo[32].numElems);
	(void) memcpy(Out_L + busInfo[33].offset, &_Out_LBUS.IbL, busInfo[33].elemSize * busInfo[33].numElems);
	(void) memcpy(Out_L + busInfo[34].offset, &_Out_LBUS.IcL, busInfo[34].elemSize * busInfo[34].numElems);
	(void) memcpy(Out_L + busInfo[35].offset, &_Out_LBUS.IAlphaL, busInfo[35].elemSize * busInfo[35].numElems);
	(void) memcpy(Out_L + busInfo[36].offset, &_Out_LBUS.IBetaL, busInfo[36].elemSize * busInfo[36].numElems);
	(void) memcpy(Out_L + busInfo[37].offset, &_Out_LBUS.IdzL, busInfo[37].elemSize * busInfo[37].numElems);
	(void) memcpy(Out_L + busInfo[38].offset, &_Out_LBUS.IdL, busInfo[38].elemSize * busInfo[38].numElems);
	(void) memcpy(Out_L + busInfo[39].offset, &_Out_LBUS.SIdL, busInfo[39].elemSize * busInfo[39].numElems);
	(void) memcpy(Out_L + busInfo[40].offset, &_Out_LBUS.DeltaIdOldL, busInfo[40].elemSize * busInfo[40].numElems);
	(void) memcpy(Out_L + busInfo[41].offset, &_Out_LBUS.DeltaIdL, busInfo[41].elemSize * busInfo[41].numElems);
	(void) memcpy(Out_L + busInfo[42].offset, &_Out_LBUS.UUdL, busInfo[42].elemSize * busInfo[42].numElems);
	(void) memcpy(Out_L + busInfo[43].offset, &_Out_LBUS.IqzL, busInfo[43].elemSize * busInfo[43].numElems);
	(void) memcpy(Out_L + busInfo[44].offset, &_Out_LBUS.IqL, busInfo[44].elemSize * busInfo[44].numElems);
	(void) memcpy(Out_L + busInfo[45].offset, &_Out_LBUS.SIqL, busInfo[45].elemSize * busInfo[45].numElems);
	(void) memcpy(Out_L + busInfo[46].offset, &_Out_LBUS.DeltaIqOldL, busInfo[46].elemSize * busInfo[46].numElems);
	(void) memcpy(Out_L + busInfo[47].offset, &_Out_LBUS.DeltaIqL, busInfo[47].elemSize * busInfo[47].numElems);
	(void) memcpy(Out_L + busInfo[48].offset, &_Out_LBUS.UUqL, busInfo[48].elemSize * busInfo[48].numElems);
	(void) memcpy(Out_L + busInfo[49].offset, &_Out_LBUS.UdSIL, busInfo[49].elemSize * busInfo[49].numElems);
	(void) memcpy(Out_L + busInfo[50].offset, &_Out_LBUS.UqSIL, busInfo[50].elemSize * busInfo[50].numElems);
	(void) memcpy(Out_L + busInfo[51].offset, &_Out_LBUS.E_ampL, busInfo[51].elemSize * busInfo[51].numElems);
	(void) memcpy(Out_L + busInfo[52].offset, &_Out_LBUS.fE_ampL, busInfo[52].elemSize * busInfo[52].numElems);
	(void) memcpy(Out_L + busInfo[53].offset, &_Out_LBUS.UAlphaSIL, busInfo[53].elemSize * busInfo[53].numElems);
	(void) memcpy(Out_L + busInfo[54].offset, &_Out_LBUS.UBetaSIL, busInfo[54].elemSize * busInfo[54].numElems);
	(void) memcpy(Out_L + busInfo[55].offset, &_Out_LBUS.DeltaIAlphaL, busInfo[55].elemSize * busInfo[55].numElems);
	(void) memcpy(Out_L + busInfo[56].offset, &_Out_LBUS.DeltaIBetaL, busInfo[56].elemSize * busInfo[56].numElems);
	(void) memcpy(Out_L + busInfo[57].offset, &_Out_LBUS.OldIAlphaL, busInfo[57].elemSize * busInfo[57].numElems);
	(void) memcpy(Out_L + busInfo[58].offset, &_Out_LBUS.OldIBetaL, busInfo[58].elemSize * busInfo[58].numElems);
	(void) memcpy(Out_L + busInfo[59].offset, &_Out_LBUS.EAlphaInstL, busInfo[59].elemSize * busInfo[59].numElems);
	(void) memcpy(Out_L + busInfo[60].offset, &_Out_LBUS.EBetaInstL, busInfo[60].elemSize * busInfo[60].numElems);
	(void) memcpy(Out_L + busInfo[61].offset, &_Out_LBUS.E_MaxL, busInfo[61].elemSize * busInfo[61].numElems);
	(void) memcpy(Out_L + busInfo[62].offset, &_Out_LBUS.E_LineL, busInfo[62].elemSize * busInfo[62].numElems);
	(void) memcpy(Out_L + busInfo[63].offset, &_Out_LBUS.Ez_ampL, busInfo[63].elemSize * busInfo[63].numElems);
	(void) memcpy(Out_L + busInfo[64].offset, &_Out_LBUS.SEL, busInfo[64].elemSize * busInfo[64].numElems);
	(void) memcpy(Out_L + busInfo[65].offset, &_Out_LBUS.IqLCurLim, busInfo[65].elemSize * busInfo[65].numElems);
	(void) memcpy(Out_L + busInfo[66].offset, &_Out_LBUS.IqLMAX, busInfo[66].elemSize * busInfo[66].numElems);
	(void) memcpy(Out_L + busInfo[67].offset, &_Out_LBUS.fIqLMAX, busInfo[67].elemSize * busInfo[67].numElems);
	(void) memcpy(Out_L + busInfo[68].offset, &_Out_LBUS.UAlphaL, busInfo[68].elemSize * busInfo[68].numElems);
	(void) memcpy(Out_L + busInfo[69].offset, &_Out_LBUS.UBetaL, busInfo[69].elemSize * busInfo[69].numElems);
	(void) memcpy(Out_L + busInfo[70].offset, &_Out_LBUS.UUAL, busInfo[70].elemSize * busInfo[70].numElems);
	(void) memcpy(Out_L + busInfo[71].offset, &_Out_LBUS.UUBL, busInfo[71].elemSize * busInfo[71].numElems);
	(void) memcpy(Out_L + busInfo[72].offset, &_Out_LBUS.UUCL, busInfo[72].elemSize * busInfo[72].numElems);
	(void) memcpy(Out_L + busInfo[73].offset, &_Out_LBUS.ChopReg, busInfo[73].elemSize * busInfo[73].numElems);
	(void) memcpy(Out_L + busInfo[74].offset, &_Out_LBUS.UUqzL, busInfo[74].elemSize * busInfo[74].numElems);
	(void) memcpy(Out_L + busInfo[75].offset, &_Out_LBUS.fUmL, busInfo[75].elemSize * busInfo[75].numElems);
	(void) memcpy(Out_L + busInfo[76].offset, &_Out_LBUS.UmL, busInfo[76].elemSize * busInfo[76].numElems);
	(void) memcpy(Out_L + busInfo[77].offset, &_Out_LBUS.DeltaIdzL, busInfo[77].elemSize * busInfo[77].numElems);
	(void) memcpy(Out_L + busInfo[78].offset, &_Out_LBUS.dEL, busInfo[78].elemSize * busInfo[78].numElems);
	(void) memcpy(Out_L + busInfo[79].offset, &_Out_LBUS.sdEL, busInfo[79].elemSize * busInfo[79].numElems);
	(void) memcpy(Out_L + busInfo[80].offset, &_Out_LBUS.UkdL, busInfo[80].elemSize * busInfo[80].numElems);
	(void) memcpy(Out_L + busInfo[81].offset, &_Out_LBUS.UkqL, busInfo[81].elemSize * busInfo[81].numElems);
	(void) memcpy(Out_L + busInfo[82].offset, &_Out_LBUS.ThetaSlipL, busInfo[82].elemSize * busInfo[82].numElems);
	(void) memcpy(Out_L + busInfo[83].offset, &_Out_LBUS.fThetaL, busInfo[83].elemSize * busInfo[83].numElems);
	(void) memcpy(Out_L + busInfo[84].offset, &_Out_LBUS.EbyFreqL, busInfo[84].elemSize * busInfo[84].numElems);
	(void) memcpy(Out_L + busInfo[85].offset, &_Out_LBUS.LmL16, busInfo[85].elemSize * busInfo[85].numElems);
	(void) memcpy(Out_L + busInfo[86].offset, &_Out_LBUS.FreqL16, busInfo[86].elemSize * busInfo[86].numElems);
	(void) memcpy(Out_L + busInfo[87].offset, &_Out_LBUS.AFSpeedzL16, busInfo[87].elemSize * busInfo[87].numElems);
	(void) memcpy(Out_L + busInfo[88].offset, &_Out_LBUS.DeltaSpeedL, busInfo[88].elemSize * busInfo[88].numElems);
	(void) memcpy(Out_L + busInfo[89].offset, &_Out_LBUS.SpeedLz1_16, busInfo[89].elemSize * busInfo[89].numElems);
	(void) memcpy(Out_L + busInfo[90].offset, &_Out_LBUS.DeltaSpeedL1, busInfo[90].elemSize * busInfo[90].numElems);
	(void) memcpy(Out_L + busInfo[91].offset, &_Out_LBUS.PowerL, busInfo[91].elemSize * busInfo[91].numElems);
	(void) memcpy(Out_L + busInfo[92].offset, &_Out_LBUS.PowerL16, busInfo[92].elemSize * busInfo[92].numElems);
	(void) memcpy(Out_L + busInfo[93].offset, &_Out_LBUS.Iaz, busInfo[93].elemSize * busInfo[93].numElems);
	(void) memcpy(Out_L + busInfo[94].offset, &_Out_LBUS.Ibz, busInfo[94].elemSize * busInfo[94].numElems);
	(void) memcpy(Out_L + busInfo[95].offset, &_Out_LBUS.Icz, busInfo[95].elemSize * busInfo[95].numElems);
	(void) memcpy(Out_L + busInfo[96].offset, &_Out_LBUS.IAlphaz, busInfo[96].elemSize * busInfo[96].numElems);
	(void) memcpy(Out_L + busInfo[97].offset, &_Out_LBUS.Ibetaz, busInfo[97].elemSize * busInfo[97].numElems);
	(void) memcpy(Out_L + busInfo[98].offset, &_Out_LBUS.ImL, busInfo[98].elemSize * busInfo[98].numElems);
	(void) memcpy(Out_L + busInfo[99].offset, &_Out_LBUS.iffL, busInfo[99].elemSize * busInfo[99].numElems);
	(void) memcpy(Out_L + busInfo[100].offset, &_Out_LBUS.IfRMSL, busInfo[100].elemSize * busInfo[100].numElems);
	(void) memcpy(Out_L + busInfo[101].offset, &_Out_LBUS.AmplL, busInfo[101].elemSize * busInfo[101].numElems);
	(void) memcpy(Out_L + busInfo[102].offset, &_Out_LBUS.AlphaL, busInfo[102].elemSize * busInfo[102].numElems);
	(void) memcpy(Out_R + busInfo[103].offset, &_Out_RBUS.DeltaSpeedRCruize, busInfo[103].elemSize * busInfo[103].numElems);
	(void) memcpy(Out_R + busInfo[104].offset, &_Out_RBUS.SpeedRzCruize, busInfo[104].elemSize * busInfo[104].numElems);
	(void) memcpy(Out_R + busInfo[105].offset, &_Out_RBUS.DeltaSpeedRABS, busInfo[105].elemSize * busInfo[105].numElems);
	(void) memcpy(Out_R + busInfo[106].offset, &_Out_RBUS.SummSpeedR, busInfo[106].elemSize * busInfo[106].numElems);
	(void) memcpy(Out_R + busInfo[107].offset, &_Out_RBUS.UUqRMAX, busInfo[107].elemSize * busInfo[107].numElems);
	(void) memcpy(Out_R + busInfo[108].offset, &_Out_RBUS.kIqR, busInfo[108].elemSize * busInfo[108].numElems);
	(void) memcpy(Out_R + busInfo[109].offset, &_Out_RBUS.URsAlpha_R, busInfo[109].elemSize * busInfo[109].numElems);
	(void) memcpy(Out_R + busInfo[110].offset, &_Out_RBUS.URsBeta_R, busInfo[110].elemSize * busInfo[110].numElems);
	(void) memcpy(Out_R + busInfo[111].offset, &_Out_RBUS.ULsAlpha_R, busInfo[111].elemSize * busInfo[111].numElems);
	(void) memcpy(Out_R + busInfo[112].offset, &_Out_RBUS.ULsBeta_R, busInfo[112].elemSize * busInfo[112].numElems);
	(void) memcpy(Out_R + busInfo[113].offset, &_Out_RBUS.SpeedRz, busInfo[113].elemSize * busInfo[113].numElems);
	(void) memcpy(Out_R + busInfo[114].offset, &_Out_RBUS.SpeedR, busInfo[114].elemSize * busInfo[114].numElems);
	(void) memcpy(Out_R + busInfo[115].offset, &_Out_RBUS.IaR, busInfo[115].elemSize * busInfo[115].numElems);
	(void) memcpy(Out_R + busInfo[116].offset, &_Out_RBUS.IbR, busInfo[116].elemSize * busInfo[116].numElems);
	(void) memcpy(Out_R + busInfo[117].offset, &_Out_RBUS.IcR, busInfo[117].elemSize * busInfo[117].numElems);
	(void) memcpy(Out_R + busInfo[118].offset, &_Out_RBUS.IAlphaR, busInfo[118].elemSize * busInfo[118].numElems);
	(void) memcpy(Out_R + busInfo[119].offset, &_Out_RBUS.IBetaR, busInfo[119].elemSize * busInfo[119].numElems);
	(void) memcpy(Out_R + busInfo[120].offset, &_Out_RBUS.IdzR, busInfo[120].elemSize * busInfo[120].numElems);
	(void) memcpy(Out_R + busInfo[121].offset, &_Out_RBUS.IdR, busInfo[121].elemSize * busInfo[121].numElems);
	(void) memcpy(Out_R + busInfo[122].offset, &_Out_RBUS.SIdR, busInfo[122].elemSize * busInfo[122].numElems);
	(void) memcpy(Out_R + busInfo[123].offset, &_Out_RBUS.DeltaIdOldR, busInfo[123].elemSize * busInfo[123].numElems);
	(void) memcpy(Out_R + busInfo[124].offset, &_Out_RBUS.DeltaIdR, busInfo[124].elemSize * busInfo[124].numElems);
	(void) memcpy(Out_R + busInfo[125].offset, &_Out_RBUS.UUdR, busInfo[125].elemSize * busInfo[125].numElems);
	(void) memcpy(Out_R + busInfo[126].offset, &_Out_RBUS.IqzR, busInfo[126].elemSize * busInfo[126].numElems);
	(void) memcpy(Out_R + busInfo[127].offset, &_Out_RBUS.IqR, busInfo[127].elemSize * busInfo[127].numElems);
	(void) memcpy(Out_R + busInfo[128].offset, &_Out_RBUS.SIqR, busInfo[128].elemSize * busInfo[128].numElems);
	(void) memcpy(Out_R + busInfo[129].offset, &_Out_RBUS.DeltaIqOldR, busInfo[129].elemSize * busInfo[129].numElems);
	(void) memcpy(Out_R + busInfo[130].offset, &_Out_RBUS.DeltaIqR, busInfo[130].elemSize * busInfo[130].numElems);
	(void) memcpy(Out_R + busInfo[131].offset, &_Out_RBUS.UUqR, busInfo[131].elemSize * busInfo[131].numElems);
	(void) memcpy(Out_R + busInfo[132].offset, &_Out_RBUS.UdSIR, busInfo[132].elemSize * busInfo[132].numElems);
	(void) memcpy(Out_R + busInfo[133].offset, &_Out_RBUS.UqSIR, busInfo[133].elemSize * busInfo[133].numElems);
	(void) memcpy(Out_R + busInfo[134].offset, &_Out_RBUS.E_ampR, busInfo[134].elemSize * busInfo[134].numElems);
	(void) memcpy(Out_R + busInfo[135].offset, &_Out_RBUS.fE_ampR, busInfo[135].elemSize * busInfo[135].numElems);
	(void) memcpy(Out_R + busInfo[136].offset, &_Out_RBUS.UAlphaSIR, busInfo[136].elemSize * busInfo[136].numElems);
	(void) memcpy(Out_R + busInfo[137].offset, &_Out_RBUS.UBetaSIR, busInfo[137].elemSize * busInfo[137].numElems);
	(void) memcpy(Out_R + busInfo[138].offset, &_Out_RBUS.DeltaIAlphaR, busInfo[138].elemSize * busInfo[138].numElems);
	(void) memcpy(Out_R + busInfo[139].offset, &_Out_RBUS.DeltaIBetaR, busInfo[139].elemSize * busInfo[139].numElems);
	(void) memcpy(Out_R + busInfo[140].offset, &_Out_RBUS.OldIAlphaR, busInfo[140].elemSize * busInfo[140].numElems);
	(void) memcpy(Out_R + busInfo[141].offset, &_Out_RBUS.OldIBetaR, busInfo[141].elemSize * busInfo[141].numElems);
	(void) memcpy(Out_R + busInfo[142].offset, &_Out_RBUS.EAlphaInstR, busInfo[142].elemSize * busInfo[142].numElems);
	(void) memcpy(Out_R + busInfo[143].offset, &_Out_RBUS.EBetaInstR, busInfo[143].elemSize * busInfo[143].numElems);
	(void) memcpy(Out_R + busInfo[144].offset, &_Out_RBUS.E_MaxR, busInfo[144].elemSize * busInfo[144].numElems);
	(void) memcpy(Out_R + busInfo[145].offset, &_Out_RBUS.E_LineR, busInfo[145].elemSize * busInfo[145].numElems);
	(void) memcpy(Out_R + busInfo[146].offset, &_Out_RBUS.Ez_ampR, busInfo[146].elemSize * busInfo[146].numElems);
	(void) memcpy(Out_R + busInfo[147].offset, &_Out_RBUS.SER, busInfo[147].elemSize * busInfo[147].numElems);
	(void) memcpy(Out_R + busInfo[148].offset, &_Out_RBUS.IqRCurLim, busInfo[148].elemSize * busInfo[148].numElems);
	(void) memcpy(Out_R + busInfo[149].offset, &_Out_RBUS.IqRMAX, busInfo[149].elemSize * busInfo[149].numElems);
	(void) memcpy(Out_R + busInfo[150].offset, &_Out_RBUS.fIqRMAX, busInfo[150].elemSize * busInfo[150].numElems);
	(void) memcpy(Out_R + busInfo[151].offset, &_Out_RBUS.UAlphaR, busInfo[151].elemSize * busInfo[151].numElems);
	(void) memcpy(Out_R + busInfo[152].offset, &_Out_RBUS.UBetaR, busInfo[152].elemSize * busInfo[152].numElems);
	(void) memcpy(Out_R + busInfo[153].offset, &_Out_RBUS.UUAR, busInfo[153].elemSize * busInfo[153].numElems);
	(void) memcpy(Out_R + busInfo[154].offset, &_Out_RBUS.UUBR, busInfo[154].elemSize * busInfo[154].numElems);
	(void) memcpy(Out_R + busInfo[155].offset, &_Out_RBUS.UUCR, busInfo[155].elemSize * busInfo[155].numElems);
	(void) memcpy(Out_R + busInfo[156].offset, &_Out_RBUS.ChopReg, busInfo[156].elemSize * busInfo[156].numElems);
	(void) memcpy(Out_R + busInfo[157].offset, &_Out_RBUS.UUqzR, busInfo[157].elemSize * busInfo[157].numElems);
	(void) memcpy(Out_R + busInfo[158].offset, &_Out_RBUS.fUmR, busInfo[158].elemSize * busInfo[158].numElems);
	(void) memcpy(Out_R + busInfo[159].offset, &_Out_RBUS.UmR, busInfo[159].elemSize * busInfo[159].numElems);
	(void) memcpy(Out_R + busInfo[160].offset, &_Out_RBUS.DeltaIdzR, busInfo[160].elemSize * busInfo[160].numElems);
	(void) memcpy(Out_R + busInfo[161].offset, &_Out_RBUS.dUUqR, busInfo[161].elemSize * busInfo[161].numElems);
	(void) memcpy(Out_R + busInfo[162].offset, &_Out_RBUS.sdUUqR, busInfo[162].elemSize * busInfo[162].numElems);
	(void) memcpy(Out_R + busInfo[163].offset, &_Out_RBUS.UkdR, busInfo[163].elemSize * busInfo[163].numElems);
	(void) memcpy(Out_R + busInfo[164].offset, &_Out_RBUS.UkqR, busInfo[164].elemSize * busInfo[164].numElems);
	(void) memcpy(Out_R + busInfo[165].offset, &_Out_RBUS.ThetaSlipR, busInfo[165].elemSize * busInfo[165].numElems);
	(void) memcpy(Out_R + busInfo[166].offset, &_Out_RBUS.fThetaR, busInfo[166].elemSize * busInfo[166].numElems);
	(void) memcpy(Out_R + busInfo[167].offset, &_Out_RBUS.EbyFreqR, busInfo[167].elemSize * busInfo[167].numElems);
	(void) memcpy(Out_R + busInfo[168].offset, &_Out_RBUS.RmR16, busInfo[168].elemSize * busInfo[168].numElems);
	(void) memcpy(Out_R + busInfo[169].offset, &_Out_RBUS.FreqR16, busInfo[169].elemSize * busInfo[169].numElems);
	(void) memcpy(Out_R + busInfo[170].offset, &_Out_RBUS.AFSpeedzR16, busInfo[170].elemSize * busInfo[170].numElems);
	(void) memcpy(Out_R + busInfo[171].offset, &_Out_RBUS.DeltaSpeedR, busInfo[171].elemSize * busInfo[171].numElems);
	(void) memcpy(Out_R + busInfo[172].offset, &_Out_RBUS.SpeedRz1_16, busInfo[172].elemSize * busInfo[172].numElems);
	(void) memcpy(Out_R + busInfo[173].offset, &_Out_RBUS.DeltaSpeedR1, busInfo[173].elemSize * busInfo[173].numElems);
	(void) memcpy(Out_R + busInfo[174].offset, &_Out_RBUS.AmplR, busInfo[174].elemSize * busInfo[174].numElems);
	(void) memcpy(Out_R + busInfo[175].offset, &_Out_RBUS.AlphaR, busInfo[175].elemSize * busInfo[175].numElems);
	(void) memcpy(Out_R + busInfo[176].offset, &_Out_RBUS.PowerR, busInfo[176].elemSize * busInfo[176].numElems);
	(void) memcpy(Out_R + busInfo[177].offset, &_Out_RBUS.PowerR16, busInfo[177].elemSize * busInfo[177].numElems);

